x, y = float(input()), float(input())

if x ** 2 + y ** 2 > 100:
    print("Вы вышли в море и рискуете быть съеденным акулой!")
elif y >= 0 and x ** 2 + y ** 2 <= 25:
    print("Опасность! Покиньте зону как можно скорее!")
elif y >= 0 and x <= 0 and y <= 5 and y <= (5 * x + 35) / 3:
    print("Опасность! Покиньте зону как можно скорее!")
elif y <= 0 and y >= 0.25 * x ** 2 + 0.5 * x - 8.75:
    print("Опасность! Покиньте зону как можно скорее!")
else:
    print("Зона безопасна. Продолжайте работу.")